tests/loadtest/results/20260617_103557_capacity_base_k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /tests/ecg_scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 30m30s max duration (incl. graceful stop):
              * ecg: 50 iterations shared among 3 VUs (maxDuration: 30m0s, gracefulStop: 30s)


Run    [ 100% ] setup()
ecg    [   0% ]

running (00m02.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m00.5s/30m0s  00/50 shared iters

running (00m03.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m01.5s/30m0s  00/50 shared iters

running (00m04.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m02.5s/30m0s  00/50 shared iters

running (00m05.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m03.5s/30m0s  00/50 shared iters

running (00m06.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m04.5s/30m0s  00/50 shared iters

running (00m07.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m05.5s/30m0s  00/50 shared iters

running (00m08.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m06.5s/30m0s  00/50 shared iters

running (00m09.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m07.5s/30m0s  00/50 shared iters

running (00m10.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m08.5s/30m0s  00/50 shared iters

running (00m11.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m09.5s/30m0s  00/50 shared iters

running (00m12.0s), 3/3 VUs, 1 complete and 0 interrupted iterations
ecg    [   2% ] 3 VUs  00m10.5s/30m0s  01/50 shared iters

running (00m13.0s), 3/3 VUs, 1 complete and 0 interrupted iterations
ecg    [   2% ] 3 VUs  00m11.5s/30m0s  01/50 shared iters

running (00m14.0s), 3/3 VUs, 1 complete and 0 interrupted iterations
ecg    [   2% ] 3 VUs  00m12.5s/30m0s  01/50 shared iters

running (00m15.0s), 3/3 VUs, 1 complete and 0 interrupted iterations
ecg    [   2% ] 3 VUs  00m13.5s/30m0s  01/50 shared iters

running (00m16.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m14.5s/30m0s  02/50 shared iters

running (00m17.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m15.5s/30m0s  02/50 shared iters

running (00m18.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m16.5s/30m0s  02/50 shared iters

running (00m19.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m17.5s/30m0s  02/50 shared iters

running (00m20.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
ecg    [   6% ] 3 VUs  00m18.5s/30m0s  03/50 shared iters

running (00m21.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
ecg    [   6% ] 3 VUs  00m19.5s/30m0s  03/50 shared iters

running (00m22.0s), 3/3 VUs, 4 complete and 0 interrupted iterations
ecg    [   8% ] 3 VUs  00m20.5s/30m0s  04/50 shared iters

running (00m23.0s), 3/3 VUs, 4 complete and 0 interrupted iterations
ecg    [   8% ] 3 VUs  00m21.5s/30m0s  04/50 shared iters

running (00m24.0s), 3/3 VUs, 4 complete and 0 interrupted iterations
ecg    [   8% ] 3 VUs  00m22.5s/30m0s  04/50 shared iters

running (00m25.0s), 3/3 VUs, 4 complete and 0 interrupted iterations
ecg    [   8% ] 3 VUs  00m23.5s/30m0s  04/50 shared iters

running (00m26.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m24.5s/30m0s  05/50 shared iters

running (00m27.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m25.5s/30m0s  05/50 shared iters

running (00m28.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m26.5s/30m0s  05/50 shared iters

running (00m29.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m27.5s/30m0s  05/50 shared iters

running (00m30.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
ecg    [  12% ] 3 VUs  00m28.5s/30m0s  06/50 shared iters

running (00m31.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
ecg    [  12% ] 3 VUs  00m29.5s/30m0s  06/50 shared iters

running (00m32.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  00m30.5s/30m0s  48/50 shared iters

running (00m33.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  00m31.5s/30m0s  48/50 shared iters

running (00m34.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  00m32.5s/30m0s  48/50 shared iters

running (00m35.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  00m33.5s/30m0s  48/50 shared iters

running (00m36.0s), 1/3 VUs, 49 complete and 0 interrupted iterations
ecg    [  98% ] 3 VUs  00m34.5s/30m0s  49/50 shared iters

running (00m37.0s), 1/3 VUs, 49 complete and 0 interrupted iterations
ecg    [  98% ] 3 VUs  00m35.5s/30m0s  49/50 shared iters

running (00m38.0s), 1/3 VUs, 49 complete and 0 interrupted iterations
ecg    [  98% ] 3 VUs  00m36.5s/30m0s  49/50 shared iters

running (00m39.0s), 1/3 VUs, 49 complete and 0 interrupted iterations
ecg    [  98% ] 3 VUs  00m37.5s/30m0s  49/50 shared iters


  █ THRESHOLDS 

    ecg_duration
    ✓ 'p(95)<30000' p(95)=16.45s

    ecg_success
    ✗ 'rate>0.95' rate=18.00%


  █ TOTAL RESULTS 

    checks_total.......: 18      0.453592/s
    checks_succeeded...: 100.00% 18 out of 18
    checks_failed......: 0.00%   0 out of 18

    ✓ ecg completed
    ✓ ecg under 30s

    CUSTOM
    ecg_duration...................: avg=11.36s  min=10.02s med=10.02s max=18.05s   p(90)=14.85s  p(95)=16.45s  
    ecg_success....................: 18.00% 9 out of 50

    HTTP
    http_req_duration..............: avg=20.16ms min=1.72ms med=5.01ms max=255.75ms p(90)=15.23ms p(95)=179.25ms
      { expected_response:true }...: avg=28.99ms min=1.72ms med=4.91ms max=255.75ms p(90)=33.22ms p(95)=250.12ms
    http_req_failed................: 38.31% 41 out of 107
    http_reqs......................: 107    2.69635/s

    EXECUTION
    iteration_duration.............: avg=2.05s   min=4.58ms med=6.03ms max=18.09s   p(90)=10.04s  p(95)=10.05s  
    iterations.....................: 50     1.259976/s
    vus............................: 1      min=0         max=3
    vus_max........................: 3      min=3         max=3

    NETWORK
    data_received..................: 120 kB 3.0 kB/s
    data_sent......................: 1.2 MB 30 kB/s



time="2026-06-17T07:36:41Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/tests/results/20260617_103557_capacity_base_summary.json': open /tests/results/20260617_103557_capacity_base_summary.json: permission denied"

running (00m39.7s), 0/3 VUs, 50 complete and 0 interrupted iterations
ecg  ✓ [ 100% ] 3 VUs  00m38.2s/30m0s  50/50 shared iters
time="2026-06-17T07:36:42Z" level=error msg="thresholds on metrics 'ecg_success' have been crossed"